In [1]:
import pandas as pd
import mysql.connector as connector
from sqlalchemy import create_engine

# Section One: Data Processing - 6 csv files

## 1) Energy Data

In [4]:
# Import csv file - omit the first row, format numeric values
energy = pd.read_csv(r"C:\Users\boeun\Desktop\SampleData\UN\SYB67_263_202411_Production, Trade and Supply of Energy.csv", 
                     skiprows=1, thousands=',')
energy.head()

,Region/Country/Area,Unnamed: 1,Year,Series,Value,Footnotes,Source
0,1,"Total, all countries or areas",1995,Primary energy production (petajoules),381716,NaN,"United Nations Statistics Division, New York, ..."
1,1,"Total, all countries or areas",2000,Primary energy production (petajoules),412282,NaN,"United Nations Statistics Division, New York, ..."
2,1,"Total, all countries or areas",2005,Primary energy production (petajoules),477690,NaN,"United Nations Statistics Division, New York, ..."
3,1,"Total, all countries or areas",2010,Primary energy production (petajoules),530871,NaN,"United Nations Statistics Division, New York, ..."
4,1,"Total, all countries or areas",2015,Primary energy production (petajoules),569646,NaN,"United Nations Statistics Division, New York, ..."

In [5]:
# Drop columns
energy.drop(energy.columns[[0, 5, 6]], axis=1, inplace=True)
energy.head()

,Unnamed: 1,Year,Series,Value
0,"Total, all countries or areas",1995,Primary energy production (petajoules),381716
1,"Total, all countries or areas",2000,Primary energy production (petajoules),412282
2,"Total, all countries or areas",2005,Primary energy production (petajoules),477690
3,"Total, all countries or areas",2010,Primary energy production (petajoules),530871
4,"Total, all countries or areas",2015,Primary energy production (petajoules),569646

In [6]:
# Rename columns and make sure the numeric values have the correct data type
energy.columns = ['Region', 'Year', 'energyUnit', 'energyValue']
energy['energyValue'] = pd.to_numeric(energy['energyValue'])
energy.head()

,Region,Year,energyUnit,energyValue
0,"Total, all countries or areas",1995,Primary energy production (petajoules),381716
1,"Total, all countries or areas",2000,Primary energy production (petajoules),412282
2,"Total, all countries or areas",2005,Primary energy production (petajoules),477690
3,"Total, all countries or areas",2010,Primary energy production (petajoules),530871
4,"Total, all countries or areas",2015,Primary energy production (petajoules),569646

In [7]:
energy['energyUnit'].unique()

array(['Primary energy production (petajoules)',
       'Net imports [Imports - Exports - Bunkers] (petajoules)',
       'Changes in stocks (petajoules)', 'Total supply (petajoules)',
       'Supply per capita (gigajoules)'], dtype=object)

In [8]:
# Extract supply per capita only
energy_supply = energy.loc[energy['energyUnit'] == 'Supply per capita (gigajoules)'].copy()
energy_supply.drop(columns=['energyUnit'], inplace=True)
energy_supply.rename(columns={'energyValue': 'GJ'}, inplace=True)
energy_supply.head()

                           Region  Year  GJ
32  Total, all countries or areas  1995  65
33  Total, all countries or areas  2000  66
34  Total, all countries or areas  2005  71
35  Total, all countries or areas  2010  74
36  Total, all countries or areas  2015  74

## 2) Carbon Dioxide Emission Estimates

In [10]:
co2 = pd.read_csv(r"C:\Users\boeun\Desktop\SampleData\UN\SYB67_310_202411_Carbon Dioxide Emission Estimates.csv", 
                  skiprows=1, thousands=',')
co2.head()

,Region/Country/Area,Unnamed: 1,Year,Series,Value,Footnotes,Source
0,1,"Total, all countries or areas",1975,Emissions (thousand metric tons of carbon diox...,16042405.0,NaN,"United Nations Statistics Division, New York, ..."
1,1,"Total, all countries or areas",1985,Emissions (thousand metric tons of carbon diox...,19348135.0,NaN,"United Nations Statistics Division, New York, ..."
2,1,"Total, all countries or areas",2005,Emissions (thousand metric tons of carbon diox...,26638238.0,NaN,"United Nations Statistics Division, New York, ..."
3,1,"Total, all countries or areas",2010,Emissions (thousand metric tons of carbon diox...,30044215.0,NaN,"United Nations Statistics Division, New York, ..."
4,1,"Total, all countries or areas",2015,Emissions (thousand metric tons of carbon diox...,31468477.0,NaN,"United Nations Statistics Division, New York, ..."

In [11]:
co2.drop(co2.columns[[0, 5, 6]], axis=1, inplace=True)
co2.head()

,Unnamed: 1,Year,Series,Value
0,"Total, all countries or areas",1975,Emissions (thousand metric tons of carbon diox...,16042405.0
1,"Total, all countries or areas",1985,Emissions (thousand metric tons of carbon diox...,19348135.0
2,"Total, all countries or areas",2005,Emissions (thousand metric tons of carbon diox...,26638238.0
3,"Total, all countries or areas",2010,Emissions (thousand metric tons of carbon diox...,30044215.0
4,"Total, all countries or areas",2015,Emissions (thousand metric tons of carbon diox...,31468477.0

In [12]:
co2.columns = ['Region', 'Year', 'co2Unit', 'co2Value']  
co2['co2Value'] = pd.to_numeric(co2['co2Value'])
co2.head()

,Region,Year,co2Unit,co2Value
0,"Total, all countries or areas",1975,Emissions (thousand metric tons of carbon diox...,16042405.0
1,"Total, all countries or areas",1985,Emissions (thousand metric tons of carbon diox...,19348135.0
2,"Total, all countries or areas",2005,Emissions (thousand metric tons of carbon diox...,26638238.0
3,"Total, all countries or areas",2010,Emissions (thousand metric tons of carbon diox...,30044215.0
4,"Total, all countries or areas",2015,Emissions (thousand metric tons of carbon diox...,31468477.0

In [13]:
co2['co2Unit'].unique()

array(['Emissions (thousand metric tons of carbon dioxide)',
       'Emissions per capita (Kilograms of carbon dioxide)'], dtype=object)

In [14]:
df_co2 = co2.loc[co2['co2Unit'] == 'Emissions per capita (Kilograms of carbon dioxide)'].copy()
df_co2.drop(columns=['co2Unit'], inplace=True)
df_co2.rename(columns={'co2Value': 'co2Kg'}, inplace=True)
df_co2.head()

                           Region  Year  co2Kg
8   Total, all countries or areas  1975    3.9
9   Total, all countries or areas  1985    4.0
10  Total, all countries or areas  2005    4.1
11  Total, all countries or areas  2010    4.3
12  Total, all countries or areas  2015    4.2

## 3) GDP

In [16]:
gdp = pd.read_csv(r"C:\Users\boeun\Desktop\SampleData\UN\SYB67_230_202411_GDP and GDP Per Capita.csv", 
                  skiprows=1, thousands=',')
gdp.head()

,Region/Country/Area,Unnamed: 1,Year,Series,Value,Footnotes,Source
0,1,"Total, all countries or areas",1995,GDP in current prices (millions of US dollars),31290901.0,NaN,"United Nations Statistics Division, New York, ..."
1,1,"Total, all countries or areas",2005,GDP in current prices (millions of US dollars),47816593.0,NaN,"United Nations Statistics Division, New York, ..."
2,1,"Total, all countries or areas",2010,GDP in current prices (millions of US dollars),66633612.0,NaN,"United Nations Statistics Division, New York, ..."
3,1,"Total, all countries or areas",2015,GDP in current prices (millions of US dollars),75440153.0,NaN,"United Nations Statistics Division, New York, ..."
4,1,"Total, all countries or areas",2020,GDP in current prices (millions of US dollars),85483570.0,NaN,"United Nations Statistics Division, New York, ..."

In [17]:
gdp.drop(gdp.columns[[0, 5, 6]], axis=1, inplace=True)
gdp.head()

,Unnamed: 1,Year,Series,Value
0,"Total, all countries or areas",1995,GDP in current prices (millions of US dollars),31290901.0
1,"Total, all countries or areas",2005,GDP in current prices (millions of US dollars),47816593.0
2,"Total, all countries or areas",2010,GDP in current prices (millions of US dollars),66633612.0
3,"Total, all countries or areas",2015,GDP in current prices (millions of US dollars),75440153.0
4,"Total, all countries or areas",2020,GDP in current prices (millions of US dollars),85483570.0

In [18]:
gdp.columns = ['Region', 'Year', 'gdpUnit', 'gdpValue']  
gdp['gdpValue'] = pd.to_numeric(gdp['gdpValue'])
gdp.head()

,Region,Year,gdpUnit,gdpValue
0,"Total, all countries or areas",1995,GDP in current prices (millions of US dollars),31290901.0
1,"Total, all countries or areas",2005,GDP in current prices (millions of US dollars),47816593.0
2,"Total, all countries or areas",2010,GDP in current prices (millions of US dollars),66633612.0
3,"Total, all countries or areas",2015,GDP in current prices (millions of US dollars),75440153.0
4,"Total, all countries or areas",2020,GDP in current prices (millions of US dollars),85483570.0

In [19]:
gdp['gdpUnit'].unique()

array(['GDP in current prices (millions of US dollars)',
       'GDP per capita (US dollars)',
       'GDP in constant 2015 prices (millions of US dollars)',
       'GDP real rates of growth (percent)'], dtype=object)

In [20]:
df_gdp = gdp.loc[gdp['gdpUnit'] == 'GDP per capita (US dollars)'].copy()
df_gdp.drop(columns=['gdpUnit'], inplace=True)
df_gdp.rename(columns={'gdpValue': 'USD'}, inplace=True)
df_gdp.head()

                           Region  Year      USD
7   Total, all countries or areas  1995   5450.0
8   Total, all countries or areas  2005   7293.0
9   Total, all countries or areas  2010   9541.0
10  Total, all countries or areas  2015  10161.0
11  Total, all countries or areas  2020  10905.0

In [21]:
energy_supply.head()

                           Region  Year  GJ
32  Total, all countries or areas  1995  65
33  Total, all countries or areas  2000  66
34  Total, all countries or areas  2005  71
35  Total, all countries or areas  2010  74
36  Total, all countries or areas  2015  74

## 4) 2021 IEA Share of modern renewables in final energy consumption

In [23]:
renewables_share_21 = pd.read_csv(r"C:\Users\boeun\Desktop\SampleData\2021 International Energy Agency - Share of modern renewables in final energy consumption (SDG 7.2), global.csv")
renewables_share_21.head()

  ISO3  Share of modern renewables  Year Units
0  ISL                       82.43  2021     %
1  GAB                       65.93  2021     %
2  NOR                       61.36  2021     %
3  SWE                       57.90  2021     %
4  URY                       51.69  2021     %

In [24]:
renewables_share_21.drop(columns=['Year', 'Units'], inplace=True)
renewables_share_21.rename(columns={'Share of modern renewables':'sharePercent'}, inplace=True)
renewables_share_21.head()

  ISO3  sharePercent
0  ISL         82.43
1  GAB         65.93
2  NOR         61.36
3  SWE         57.90
4  URY         51.69

## 5) ISO3 Country Codes

In [26]:
iso3 = pd.read_csv(r"C:\Users\boeun\Desktop\SampleData\iso3.csv")
iso3.head()

     Country Name ISO3
0     Afghanistan  AFG
1         Albania  ALB
2         Algeria  DZA
3  American Samoa  ASM
4         Andorra  AND

In [27]:
iso3.rename(columns={'Country Name':'Region'}, inplace=True)
iso3.head()

           Region ISO3
0     Afghanistan  AFG
1         Albania  ALB
2         Algeria  DZA
3  American Samoa  ASM
4         Andorra  AND

## 6) Iceland Energy Mix

In [29]:
ice_23 = pd.read_csv(r"C:\Users\boeun\Desktop\SampleData\International Energy Agency - Total energy supply, Iceland, 2023.csv")
ice_23

  Total energy supply, Iceland, 2023   Value  Year Units
0                               Coal    3808  2023    TJ
1                              Hydro   51191  2023    TJ
2      Geothermal, solar, wind, etc.  182601  2023    TJ
3                 Biofuels and waste     890  2023    TJ
4                                Oil   23235  2023    TJ

In [30]:
total_TJ = ice_23['Value'].sum()
total_TJ

261725

In [31]:
ice_23['Percent'] = ( ice_23['Value'] / total_TJ ) * 100
ice_23

  Total energy supply, Iceland, 2023   Value  Year Units    Percent
0                               Coal    3808  2023    TJ   1.454962
1                              Hydro   51191  2023    TJ  19.559079
2      Geothermal, solar, wind, etc.  182601  2023    TJ  69.768268
3                 Biofuels and waste     890  2023    TJ   0.340052
4                                Oil   23235  2023    TJ   8.877639

In [32]:
ice_23.drop(columns=['Year', 'Units'], inplace=True)
ice_23.rename(columns={'Total energy supply, Iceland, 2023':'Source', 'Value':'energyTJ'}, inplace=True)
ice_23

                          Source  energyTJ    Percent
0                           Coal      3808   1.454962
1                          Hydro     51191  19.559079
2  Geothermal, solar, wind, etc.    182601  69.768268
3             Biofuels and waste       890   0.340052
4                            Oil     23235   8.877639

# Section Two: Load data to MySQL

In [34]:
# Connect to MySQL
try:
    connection = connector.connect(user="root", password="123456")
    print("Successful connection")
except:
    print("Error connecting to the database")

Successful connection

In [35]:
# Create a cursor
cursor = connection.cursor()

In [36]:
# Create a database
cursor.execute("CREATE DATABASE global_data")
print("global_data database was created.\n")

global_data database was created.

In [37]:
# Set global_data database for use
cursor.execute("USE global_data")
print("The global_data database is in use now.\n")

The global_data database is in use now.

In [38]:
# Create tables in the global_data database
create_energy_table="""
CREATE TABLE energy (
Region VARCHAR(200),
Year INT,
GJ DECIMAL,
PRIMARY KEY (Region, Year)
);"""

cursor.execute(create_energy_table)
print("energy table was created.\n")

energy table was created.

In [39]:
create_co2_table="""
CREATE TABLE co2 (
Region VARCHAR(200),
Year INT,
co2Kg DECIMAL,
PRIMARY KEY (Region, Year)
);"""

cursor.execute(create_co2_table)
print("co2 table was created.\n")

co2 table was created.

In [40]:
create_gdp_table="""
CREATE TABLE gdp (
Region VARCHAR(200),
Year INT,
USD DECIMAL,
PRIMARY KEY (Region, Year)
);"""

cursor.execute(create_gdp_table)
print("gdp table was created.\n")

gdp table was created.

In [41]:
create_renewable_share_table="""
CREATE TABLE renewable_share (
ISO3 CHAR(3),
sharePercent DECIMAL,
PRIMARY KEY (ISO3)
);"""

cursor.execute(create_renewable_share_table)
print("renewable_share table was created.\n")

renewable_share table was created.

In [42]:
create_iso3_table="""
CREATE TABLE iso3 (
Region VARCHAR(200),
ISO3 CHAR(3),
PRIMARY KEY (Region)
);"""

cursor.execute(create_iso3_table)
print("iso3 table was created.\n")

iso3 table was created.

In [43]:
create_iceland23_table="""
CREATE TABLE iceland23 (
Source VARCHAR(50),
energyTJ INT,
Percent DECIMAL,
PRIMARY KEY (SOURCE)
);"""

cursor.execute(create_iceland23_table)
print("iceland23 table was created.\n")

iceland23 table was created.

In [44]:
# Create an engine
engine = create_engine("mysql+mysqlconnector://root:123456@localhost/global_data")

In [45]:
# Send tables to the database
energy_supply.to_sql('energy', con=engine, if_exists='append', index=False)

1856

In [46]:
df_co2.to_sql('co2', con=engine, if_exists='append', index=False)

1722

In [47]:
df_gdp.to_sql('gdp', con=engine, if_exists='append', index=False)

1694

In [48]:
renewables_share_21.to_sql('renewable_share', con=engine, if_exists='append', index=False)

146

In [49]:
iso3.to_sql('iso3', con=engine, if_exists='append', index=False)

264

In [50]:
ice_23.to_sql('iceland23', con=engine, if_exists='append', index=False)

5

In [51]:
# Close MySQL connection
connection.close()